max_batch_size: 0
backend: "python"

input [
  {
      name: "documents"
      data_type: TYPE_STRING
      dims: [ -1 ]
  }
]

output [
  {
      name: "summarization"
      data_type: TYPE_STRING
      dims: [ -1 ]
  }
]

instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]